<img src="pandas_logo.svg" alt="NumPy Logo" style="width:250px; height:100px;">
<h1>Transpose, Drop, Apply, Getdummies in Pandas</h1>

In [85]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [87]:
df = pd.DataFrame(
    {
        "Name":["Ram", "Mohan", "David"],
        "Age":[27, 29, 30],
        "Income":[70000, 90000, 61000]
    }
)
df

    Name  Age  Income
0    Ram   27   70000
1  Mohan   29   90000
2  David   30   61000

<h4>Pandas Transpose:</h4>

In [90]:
df1 = df.T
df1

            0      1      2
Name      Ram  Mohan  David
Age        27     29     30
Income  70000  90000  61000

<h4>Pandas Drop() Method:</h4>

In [93]:
df.drop("Age", axis = 1)

    Name  Income
0    Ram   70000
1  Mohan   90000
2  David   61000

In [95]:
df.drop(["Age", "Income"], axis = 1)

    Name
0    Ram
1  Mohan
2  David

In [97]:
df.drop(columns = "Age")

    Name  Income
0    Ram   70000
1  Mohan   90000
2  David   61000

In [99]:
df.drop(columns = ["Age", "Income"])

    Name
0    Ram
1  Mohan
2  David

In [101]:
df.drop(0)

    Name  Age  Income
1  Mohan   29   90000
2  David   30   61000

<h4>Pandas Apply() Function:</h4>

In [104]:
df[["Income"]].apply(np.sqrt)

       Income
0  264.575131
1  300.000000
2  246.981781

In [106]:
aa = df["Name"].apply(lambda x : "Manager" if x == "Mohan" else "Software Engineer")
aa

0    Software Engineer
1              Manager
2    Software Engineer
Name: Name, dtype: object

In [108]:
pd.concat([df, aa], axis = 1)

    Name  Age  Income               Name
0    Ram   27   70000  Software Engineer
1  Mohan   29   90000            Manager
2  David   30   61000  Software Engineer

In [110]:
bb = df["Age"].apply(lambda x : x + 1)
bb

0    28
1    30
2    31
Name: Age, dtype: int64

In [113]:
pd.concat((df, bb), axis = 1)

    Name  Age  Income  Age
0    Ram   27   70000   28
1  Mohan   29   90000   30
2  David   30   61000   31

In [115]:
def myfunc(x):
    return x + 1
cc = df["Age"].apply(myfunc)
cc

0    28
1    30
2    31
Name: Age, dtype: int64

In [117]:
pd.concat([df, cc], axis = 1)

    Name  Age  Income  Age
0    Ram   27   70000   28
1  Mohan   29   90000   30
2  David   30   61000   31

<h4>Pandas Getdummies() Method:</h4>

In [120]:
df1 = pd.DataFrame(
    {
        "Name":["Ram", "Mohan", "David"],
        "Age":[27, 29, 30],
        "Income":[70000, 90000, 61000]
    }
)
df1

    Name  Age  Income
0    Ram   27   70000
1  Mohan   29   90000
2  David   30   61000

In [122]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Income  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [124]:
df1.Name.unique()

array(['Ram', 'Mohan', 'David'], dtype=object)

<h5>1st method:</h5>

In [129]:
ddff = pd.get_dummies(df1, columns = ["Name"], dtype = int)
ddff

   Age  Income  Name_David  Name_Mohan  Name_Ram
0   27   70000           0           0         1
1   29   90000           0           1         0
2   30   61000           1           0         0

In [131]:
ddff = pd.get_dummies(df1, columns = ["Name"], dtype = int, prefix = "ddff", prefix_sep = "*")
ddff

   Age  Income  ddff*David  ddff*Mohan  ddff*Ram
0   27   70000           0           0         1
1   29   90000           0           1         0
2   30   61000           1           0         0

In [133]:
ddff = pd.get_dummies(df1, columns = ["Name"], dtype = int, prefix = "ddff", prefix_sep = "*", drop_first = True)
ddff

   Age  Income  ddff*Mohan  ddff*Ram
0   27   70000           0         1
1   29   90000           1         0
2   30   61000           0         0

<h5>2nd method:</h5>

In [138]:
xx = pd.get_dummies(df1["Name"], dtype = int).join(df1["Name"])
xx

   David  Mohan  Ram   Name
0      0      0    1    Ram
1      0      1    0  Mohan
2      1      0    0  David

In [140]:
xx = pd.get_dummies(df1["Name"], dtype = int, drop_first = True)
xx

   Mohan  Ram
0      0    1
1      1    0
2      0    0

In [142]:
df3 = pd.concat((df1, xx), axis = 1)
df3

    Name  Age  Income  Mohan  Ram
0    Ram   27   70000      0    1
1  Mohan   29   90000      1    0
2  David   30   61000      0    0

In [146]:
df4 = df3.drop("Name", axis = 1)
df4

   Age  Income  Mohan  Ram
0   27   70000      0    1
1   29   90000      1    0
2   30   61000      0    0